/**
 * Проект: Волк, Овца и Капуста
 * 
 * Суть проекта:
 * Вам необходимо перевезти всех участников игры (волка, овцу и капусту) на правый берег так, чтобы соблюдались несколько условий:
 *  1. Волк НЕ может остаться вдвоем с овцой
 *  2. Овца НЕ может остаться вдвоем с капустой
 *  3. Перевозка в лодке осуществляется ПО ОДНОМУ
 * 
 * Нюансы:
 *  1. Нельзя поместить в лодку персонажа, если позиция лодки != позиции персонажа
 *  2. Нельзя высадить персонажа на берег, если позиция берега != позиции лодки
 */